tutorials/iceFoam_tutorial/NACA0012/NACA00122D_4deg_v150/system/wallFilmRegion/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method          structured;

structuredCoeffs
{
    method      simple;
    patches     (region0_to_wallFilmRegion_wallFilmFaces);

    coeffs
    {
        n       (4 1 2);
    }
}





// ************************************************************************* //
